[
  {
    "keywords": ["nowy", "projekt", "tworzenie", "stworzyć", "dodać projekt"],
    "content": "Aby utworzyć nowy projekt, kliknij duży niebieski przycisk '+ Nowy Projekt' na dole lewego paska bocznego. Wypełnij nazwę, daty i dodaj członków z listy. Możesz też opcjonalnie zdefiniować budżet. Możesz również tworzyć projekty na podstawie zapisanych szablonów."
  },
  {
    "keywords": ["edytuj", "edycja", "projekt", "zmień", "nazwa", "opis", "członkowie", "data", "kto może edytować", "dodać członków", "do projektu"],
    "content": "Będąc w widoku projektu, kliknij przycisk 'Edytuj projekt' w nagłówku (obok nazwy projektu). Zazwyczaj tylko właściciel projektu i administratorzy mogą edytować jego główne ustawienia. Pozwoli Ci to zmienić nazwę, opis, daty rozpoczęcia i zakończenia, priorytet oraz listę członków."
  },
  {
    "keywords": ["zakończ", "zamknij", "archiwum", "zarchiwizować", "projekt", "ukończ"],
    "content": "Aby zakończyć (zarchiwizować) projekt, musisz najpierw upewnić się, że wszystkie zadania w nim są oznaczone jako 'Wykonane'. Następnie, będąc w widoku projektu, kliknij przycisk 'Zakończ projekt' w nagłówku. Tylko właściciel projektu może to zrobić."
  },
  {
    "keywords": ["archiwum", "zakończone", "stare", "projekty", "gdzie", "znaleźć"],
    "content": "Zakończone projekty trafiają do Archiwum. Aby je przeglądać, kliknij przycisk 'Zasoby i Narzędzia' na dole lewego paska bocznego, a następnie wybierz 'Archiwum Projektów'. Zobaczysz tam listę wszystkich zakończonych projektów."
  },
  {
    "keywords": ["ulubione", "serce", "gwiazdka", "przypnij", "projekt", "szybki dostęp"],
    "content": "Aby dodać projekt do ulubionych i widzieć go na głównej liście w pasku bocznym, przejdź do widoku 'Wszystkie projekty'. Znajdź kafelek projektu i kliknij ikonę serca w prawym górnym rogu. Kliknij ponownie, aby usunąć z ulubionych."
  },
  {
    "keywords": ["nowe", "zadanie", "dodać", "stworzyć", "plus", "fab"],
    "content": "Aby dodać nowe zadanie, kliknij okrągły, niebieski przycisk '+' w prawym dolnym rogu. Otworzy się menu, wybierz 'Nowe zadanie' (niebieska ikona). Możesz też kliknąć ikonę '+' w kolumnie 'Do realizacji' na tablicy Kanban danego projektu."
  },
  {
    "keywords": ["szybkie", "zadanie", "specjalne", "czerwony", "przycisk", "inbox", "skrzynka"],
    "content": "Możesz dodać 'Szybkie Zadanie' (Specjalne) klikając okrągły, czerwony przycisk '+' w prawym dolnym rogu. Zadania te automatycznie trafiają do Twojej 'Skrzynki zadań' z terminem na jutro i są przypisane tylko do Ciebie."
  },
  {
    "keywords": ["ukończyć", "zakończyć", "zrobić", "zadanie", "odhaczyć", "checkbox", "ptaszek"],
    "content": "Aby ukończyć zadanie jednoosobowe, po prostu kliknij pole wyboru (checkbox) po lewej stronie karty zadania na tablicy Kanban lub na liście 'Mój Dzień'. Jeśli zadanie ma nieukończone podzadania, musisz najpierw je ukończyć, zanim zamkniesz zadanie główne."
  },
  {
    "keywords": ["wieloosobowe", "zadanie", "ukończyć", "status", "osoby", "oznacz", "moja część"],
    "content": "Zadania wieloosobowego nie można ukończyć checkboxem. Musisz otworzyć jego szczegóły (klikając na kafelek), przejść do zakładki 'Osoby' (ikona postaci) i kliknąć przycisk 'Oznacz jako wykonane' przy swoim nazwisku. Zadanie zostanie w pełni ukończone, gdy wszyscy przypisani to zrobią."
  },
  {
    "keywords": ["edytuj", "edytować", "zadanie", "zmień", "nazwa", "opis", "termin", "priorytet", "status", "cykliczność", "zmienić status", "przypisać", "osoba", "do zadania", "cykliczne", "powtarzające"],
    "content": "Aby edytować zadanie, otwórz jego szczegóły (kliknij kafelek). W oknie modala kliknij przycisk 'Edytuj'. Pola staną się aktywne. Możesz zmienić tytuł, a w odpowiednich zakładkach (ikonach) możesz zmienić opis, termin, priorytet, status, osoby przypisane oraz ustawić cykliczność."
  },
  {
    "keywords": ["usunąć", "skasować", "wyrzucić", "zadanie", "kosz", "kto może usunąć"],
    "content": "Aby usunąć zadanie, otwórz jego szczegóły (kliknij kafelek). W lewym dolnym rogu okna modala znajdziesz czerwony przycisk 'Usuń zadanie'. Pamiętaj, że ta operacja jest nieodwracalna. Tylko twórca zadania lub właściciel projektu mogą je usunąć."
  },
  {
    "keywords": ["przenieść", "przesuń", "zadanie", "inny projekt", "zły projekt"],
    "content": "Aby przenieść zadanie do innego projektu, otwórz szczegóły zadania. Przejdź do zakładki 'Akcje' (ikona zębatki) i kliknij przycisk 'Przenieś do innego projektu'. Wybierz projekt docelowy z listy i potwierdź."
  },
  {
    "keywords": ["podzadanie", "subtask", "dodać", "nowe", "lista zadań"],
    "content": "Aby dodać podzadanie, otwórz zadanie główne. Rozwiń sekcję 'Podzadania' (klikając na jej nagładek) i kliknij przycisk 'Dodaj podzadanie'. W nowym oknie wpisz tytuł i wybierz osoby przypisane (tylko z listy osób przypisanych do zadania głównego)."
  },
  {
    "keywords": ["ukończyć", "podzadanie", "checkbox", "subtask", "oznacz"],
    "content": "Aby ukończyć podzadanie, otwórz zadanie główne i rozwiń sekcję 'Podzadania'. Kliknij checkbox obok podzadania. Jeśli jesteś jedyną przypisaną osobą, zostanie ono ukończone. Jeśli jest wieloosobowe, tylko Twoja część zostanie oznaczona jako gotowa."
  },
  {
    "keywords": ["budżet", "projekt", "koszty", "pieniądze", "pozycja budżetowa", "zapisz"],
    "content": "Aby zarządzać budżetem projektu, musisz być jego właścicielem. Podczas tworzenia lub edycji projektu, zaznacz opcję 'Określ budżet projektu'. Możesz tam wpisać całkowitą kwotę oraz zdefiniować 'pozycje budżetowe' (np. 'Grafika', 'Marketing'). Pozycje te muszą sumować się do kwoty całkowitej. Pamiętaj, aby kliknąć 'Zapisz budżet' przed zapisaniem projektu."
  },
  {
    "keywords": ["budżet", "zadanie", "koszt", "przypisz", "pozycja", "kwota", "dolar", "$"],
    "content": "Możesz przypisać koszty do zadania tylko w projektach, które mają zdefiniowany budżet. Otwórz zadanie, przejdź do zakładki z ikoną '$' (Koszty Zadania). Zaznacz 'Przypisz koszty do zadania', a następnie dodaj pozycje, wybierając je z listy budżetowej projektu i podając kwotę."
  },
  {
    "keywords": ["sondaż", "głosowanie", "nowy", "stworzyć", "ankieta", "zdjęcie", "obrazek", "jak dodać zdjęcia"],
    "content": "Aby utworzyć nowy sondaż, musisz być w widoku projektu. Kliknij niebieski przycisk '+' w prawym dolnym rogu i wybierz 'Nowy sondaż' (zielona ikona). Wypełnij tytuł, opcje (możesz dodać zdjęcia do opcji) i wybierz, kto ma głosować."
  },
  {
    "keywords": ["sondaż", "głosować", "głosowanie", "odpowiedź", "ankieta", "wyniki"],
    "content": "Gdy w projekcie pojawi się nowy kafelek sondażu (w kolumnie 'Do realizacji'), kliknij na niego. Otworzy się okno szczegółów, w którym możesz zagłosować, klikając na wybraną opcję. Po zagłosowaniu zobaczysz bieżące wyniki."
  },
  {
    "keywords": ["zamknij", "zakończ", "usuń", "sondaż", "ankieta"],
    "content": "Tylko twórca sondażu może nim zarządzać. Otwórz szczegóły sondażu (klikając na jego kafelek). Na dole okna znajdziesz przyciski 'Zakończ sondaż' (blokuje dalsze głosowanie i przenosi kafelek do 'Wykonane') oraz 'Usuń sondaż' (trwale usuwa sondaż)."
  },
  {
    "keywords": ["filtr", "filtrowanie", "sortuj", "sortowanie", "data", "priorytet", "osoba"],
    "content": "W widoku projektu (na komputerze) w nagłówku znajdziesz przycisk 'Filtr' oraz ikonę sortowania (strzałki). Filtr pozwala zawęzić listę zadań (np. tylko do jednej osoby lub priorytetu), a sortowanie układa zadania wg daty."
  },
  {
    "keywords": ["szablon", "szablony", "nowy projekt", "zasoby", "narzędzia"],
    "content": "Szablony projektów pozwalają szybko tworzyć nowe projekty z predefiniowaną listą zadań. Aby zarządzać szablonami lub stworzyć z nich projekt, kliknij 'Zasoby i Narzędzia' na dole paska bocznego, a następnie 'Szablony Projektów'."
  },
  {
    "keywords": ["ustawienia", "profil", "zdjęcie", "awatar", "nazwa", "hasło", "zmień"],
    "content": "Aby zmienić swoje ustawienia, kliknij ikonę zębatki (Ustawienia) na dole paska bocznego. Otworzy się okno, w którym możesz zmienić swoje zdjęcie profilowe (awatar), nazwę użytkownika oraz hasło."
  },
  {
    "keywords": ["grupa", "zespół", "dział", "podgrupa", "zmień", "dołącz", "firma"],
    "content": "W oknie 'Ustawienia' (ikona zębatki) możesz zmienić swój dział (podgrupę) lub całkowicie zmienić grupę/zespół, do którego należysz. Jeśli jesteś właścicielem grupy, musisz najpierw przekazać własność innemu członkowi, zanim ją opuścisz."
  },
  {
    "keywords": ["mój dzień", "dzisiaj", "dziś", "zaległe", "termin", "plan"],
    "content": "Widok 'Mój Dzień' to Twój osobisty plan. Automatycznie pokazuje wszystkie Twoje zadania (ze wszystkich projektów), które są zaległe lub mają termin wyznaczony na dziś. Możesz używać strzałek, aby przeglądać poprzednie i następne dni."
  },
  {
    "keywords": ["dashboard", "pulpit", "kpi", "statystyki", "opóźnienia", "obciążenie", "co pokazuje", "wszystkie moje zadania"],
    "content": "Widok 'Mój Dashboard' to Twój osobisty pulpit. Pokazuje kluczowe wskaźniki (KPI) dotyczące Twoich opóźnień, opóźnień w zespole, obciążenia pracą oraz nadchodzących terminów. Poniżej znajduje się też pełna tablica Kanban ze wszystkimi Twoimi zadaniami."
  },
  {
    "keywords": ["edytuj", "układ", "przesuń", "kolejność", "kafelki", "dashboard", "projekty"],
    "content": "W widoku 'Mój Dashboard' oraz 'Wszystkie projekty' możesz zmienić układ kafelków. Kliknij przycisk 'Edytuj układ', przeciągnij kafelki w wybranej kolejności (chwytając je), a następnie kliknij 'Zapisz układ', aby zapamiętać nową kolejność."
  },
  {
    "keywords": ["pomoc", "asystent", "bot", "pytanie", "instrukcja", "jak"],
    "content": "Cześć. Jestem asystentem AI. Możesz mnie zapytać o dowolną funkcję aplikacji, np. 'Jak dodać zadanie?' lub 'Jak działa budżet?'. Postaram się znaleźć odpowiedź w mojej bazie wiedzy."
  },
  {
    "keywords": ["zasoby", "narzędzia", "co to", "linki", "archiwum", "szablony", "czym są"],
    "content": "'Zasoby i Narzędzia' to specjalna sekcja na dole lewego paska bocznego. Znajdziesz tam dostęp do rzadziej używanych funkcji, takich jak 'Archiwum Projektów', 'Szablony Projektów' oraz linki do dokumentacji i wsparcia technicznego."
  },
  {
    "keywords": ["sondaż", "ankieta", "głosowanie", "co to jest", "definicja"],
    "content": "Sondaż (lub ankieta) to narzędzie wewnątrz projektu, które pozwala zespołowi szybko głosować nad opcjami. Jest to przydatne do podejmowania decyzji, np. wyboru projektu graficznego lub ustalenia priorytetu. Sondaże pojawiają się na tablicy Kanban jak zadania."
  },
  {
    "keywords": ["skrzynka zadań", "inbox", "co to jest", "gdzie jest", "szybkie zadania", "czym jest"],
    "content": "'Skrzynka zadań' (Inbox) to domyślne miejsce, do którego trafiają 'Szybkie Zadania' (tworzone czerwonym przyciskiem '+'). Jest to lista zadań tylko dla Ciebie, które możesz później posortować i przenieść do odpowiednich projektów."
  },
  {
    "keywords": ["chat", "asystent", "bot", "ulepszyć", "bez ai", "pomoc", "alternatywa"],
    "content": "Obecny asystent AI służy do dynamicznego odpowiadania na pytania. Alternatywną formą 'ulepszenia' pomocy bez AI mogłoby być wdrożenie statycznej, przeszukiwalnej bazy wiedzy (FAQ) lub dodanie dedykowanych formularzy ('Zgłoś błąd', 'Zaproponuj funkcję'), które kierowałyby zgłoszenia bezpośrednio do zespołu wsparcia."
  },
  {
    "keywords": ["usunąć", "skasować", "projekt", "nieodwracalne", "konsekwencje"],
    "content": "Obecnie system wspiera tylko archiwizację (zakończenie) projektów. Funkcja trwałego usunięcia projektu nie jest dostępna dla użytkowników. Zakończone projekty można znaleźć w Archiwum."
  },
  {
    "keywords": ["priorytet", "zadanie", "do czego służy", "ważne", "pilne"],
    "content": "Priorytet (np. Niski, Średni, Wysoki) pomaga wizualnie oznaczyć ważność zadania na tablicy Kanban. Umożliwia także filtrowanie i sortowanie zadań, aby zespół wiedział, na czym należy się skupić w pierwszej kolejności."
  },
  {
    "keywords": ["opis", "projektu", "gdzie", "zobaczyć", "informacje"],
    "content": "Opis projektu jest widoczny w głównym widoku projektu, tuż pod jego nazwą i datami. Jeśli opis jest długi, może być zwinięty. Kliknij '...więcej', aby go rozwinąć."
  },
  {
    "keywords": ["opuść", "opuścić", "odejść", "projekt", "członkowie"],
    "content": "Aby opuścić projekt, musisz poprosić właściciela projektu lub administratora, aby usunął Cię z listy członków. Możesz to zrobić, edytując projekt i usuwając swoje nazwisko z listy 'Członkowie'."
  },
  {
    "keywords": ["kanban", "tablica", "kolumny", "statusy", "co to jest"],
    "content": "Tablica Kanban to główny widok projektu. Składa się z kolumn (np. 'Do realizacji', 'W trakcie', 'Wykonane'), które reprezentują statusy zadań. Możesz przeciągać kafelki zadań między kolumnami, aby zaktualizować ich postęp."
  },
  {
    "keywords": ["kanban", "kolumny", "kolejność", "zmień", "edytuj", "układ"],
    "content": "Kolejność głównych kolumn statusów (np. 'Do realizacji') jest stała. Możesz jednak zmieniać kolejność kafelków zadań wewnątrz kolumn, przeciągając je w górę lub w dół."
  },
  {
    "keywords": ["powiadomienia", "dzwonek", "alert", "nowości", "ustawienia", "jak działają"],
    "content": "Powiadomienia (ikona dzwonka w prawym górnym rogu) informują Cię o ważnych zdarzeniach, np. gdy ktoś przypisze Ci zadanie, wspomni o Tobie w komentarzu lub gdy zbliża się termin. Ustawieniami powiadomień możesz zarządzać w swoim profilu."
  },
  {
    "keywords": ["komentarz", "dodać", "zadanie", "dyskusja", "rozmowa"],
    "content": "Aby dodać komentarz, otwórz szczegóły zadania (kliknij kafelek). Na dole okna znajdziesz pole 'Dodaj komentarz'. Wpisz treść i naciśnij Enter. Możesz użyć '@', aby wspomnieć o innym członku projektu."
  },
  {
    "keywords": ["wspomnienie", "mention", "@", "oznaczyć", "komentarz", "co to jest"],
    "content": "Wspomnienie (mention) to sposób na powiadomienie konkretnej osoby. W polu komentarza wpisz symbol '@' a następnie zacznij pisać nazwę użytkownika (np. '@Anna'). Wybrana osoba otrzyma powiadomienie o Twoim komentarzu."
  },
  {
    "keywords": ["przywróć", "przywrócić", "archiwum", "zakończone", "projekt"],
    "content": "Aby przywrócić projekt z archiwum, przejdź do 'Archiwum Projektów' (przez 'Zasoby i Narzędzia'). Znajdź projekt na liście i kliknij przycisk 'Przywróć'. Projekt wróci na listę 'Wszystkie projekty', a jego zadania znów staną się aktywne."
  },
  {
    "keywords": ["usunąć", "skasować", "podzadanie", "subtask"],
    "content": "Tak. Otwórz zadanie główne i rozwiń sekcję 'Podzadania'. Obok nazwy podzadania znajdziesz ikonę kosza lub przycisk 'Usuń'. Usunięcie podzadania jest zazwyczaj nieodwracalne."
  },
  {
    "keywords": ["plik", "załącznik", "dodać", "upload", "zadanie"],
    "content": "Otwórz szczegóły zadania. Poszukaj sekcji 'Załączniki' (często z ikoną spinacza). Kliknij 'Dodaj załącznik' i wybierz plik z komputera lub usługi chmurowej (np. Google Drive)."
  },
  {
    "keywords": ["właściciel", "projektu", "zmień", "przekaż", "własność"],
    "content": "Tak, tylko obecny właściciel projektu może przekazać własność. Przejdź do edycji projektu (przycisk 'Edytuj projekt'). Na liście członków znajdź osobę, która ma przejąć projekt i kliknij ikonę 'Przekaż własność' (np. korona) obok jej nazwiska."
  }
]
