[
  {
    "keywords": ["dodać", "członek", "zespół", "osoba", "zaprosić", "użytkownik", "projektu"],
    "content": "Aby dodać członka do projektu, musisz być jego właścicielem. Otwórz projekt, kliknij przycisk 'Edytuj projekt' w nagłówku. W oknie edycji znajdź sekcję 'Członkowie zespołu'. Kliknij na awatary osób, które chcesz dodać, aby je zaznaczyć (pojawią się jako 'wybrane'). Na koniec kliknij 'Zapisz zmiany'."
  },
  {
    "keywords": ["usunąć", "skasować", "wyrzucić", "członek", "zespół", "osoba", "projektu"],
    "content": "Aby usunąć członka z projektu, musisz być jego właścicielem. Otwórz projekt, kliknij 'Edytuj projekt'. W sekcji 'Członkowie zespołu' odkliknij awatar osoby, którą chcesz usunąć. Kliknij 'Zapisz zmiany'. Uwaga: Nie można usunąć właściciela projektu."
  },
  {
    "keywords": ["ukończyć", "zakończyć", "zamknąć", "zrobić", "zadanie", "odhaczyć", "checkbox"],
    "content": "Aby ukończyć zadanie jednoosobowe, po prostu kliknij pole wyboru (checkbox) po lewej stronie karty zadania. Jeśli zadanie jest wieloosobowe, musisz otworzyć jego szczegóły, przejść do zakładki 'Osoby' i kliknąć przycisk 'Oznacz jako wykonane' przy swoim nazwisku. Zadanie zostanie w pełni ukończone, gdy wszyscy przypisani to zrobią."
  },
  {
    "keywords": ["usunąć", "skasować", "wyrzucić", "zadanie"],
    "content": "Aby usunąć zadanie, otwórz jego szczegóły, klikając na jego kafelek. W oknie szczegółów, w lewym dolnym rogu, znajdziesz czerwony przycisk 'Usuń zadanie'. Pamiętaj, że ta operacja jest nieodwracalna. Tylko twórca zadania lub właściciel projektu mogą je usunąć."
  },
  {
    "keywords": ["edytować", "zmienić", "nazwa", "opis", "termin", "priorytet", "zadanie"],
    "content": "Aby edytować zadanie, otwórz jego szczegóły. W trybie widoku kliknij przycisk 'Edytuj' (obok przycisku 'Usuń'). Pola staną się aktywne. Możesz zmienić tytuł, opis w zakładce 'Opis', termin w zakładce 'Termin' oraz priorytet i status w odpowiednich zakładkach. Po dokonaniu zmian kliknij 'Zapisz zmiany'."
  },
  {
    "keywords": ["budżet", "koszty", "pieniądze", "wydać", "projekt", "śledzić"],
    "content": "Aby zarządzać budżetem projektu, musisz być jego właścicielem. Podczas tworzenia lub edycji projektu, zaznacz opcję 'Określ budżet projektu'. Możesz tam wpisać całkowitą kwotę oraz zdefiniować 'pozycje budżetowe' (np. 'Grafika', 'Marketing'). Pozycje te muszą sumować się do kwoty całkowitej. Po zapisaniu budżetu, możesz przypisywać koszty do poszczególnych zadań, wybierając odpowiednią pozycję z listy."
  },
  {
    "keywords": ["archiwum", "zakończone", "stare", "projekty", "gdzie", "znaleźć"],
    "content": "Zakończone projekty trafiają do Archiwum. Aby je przeglądać, kliknij przycisk 'Zasoby i Narzędzia' na dole paska bocznego, a następnie wybierz 'Archiwum Projektów'. Zobaczysz tam listę wszystkich zakończonych projektów."
  }
]
